/*
题目：手机尾号
这个程序的目的就是：根据给定的手机尾号（4位），按照一定的规则来打分。其规则如下：
如果出现连号，不管升序还是降序，都加5分。例如：5678,4321都满足加分标准。
前三个数字相同，或后三个数字相同，都加3分。例如：4888,6665,7777都满足加分的标准。注意：7777因为满足这条标准两次，所以这条规则给它加了6分。
符合AABB或者ABAB模式的加1分。例如：2255,3939,7777都符合这个模式，所以都被加分。注意：7777因为满足这条标准两次，所以这条标准给它加了2分。
含有：6，8，9中任何一个数字，每出现一次加1分。例如4326,6875,9918都符合加分标准。其中，6875被加2分；9918被加3分。

输入格式：
第一行是一个整数n，表示下边有多少输入行，接下来是n行4位一组的数据，就是等待计算加分的手机尾号。

输出格式：
每一行输入对应一行输出。
*/
#include<iostream>
using namespace std;
int main()
{
	int n;
	cin>>n;
	int a[n+1];
	for(int i=1;i<=n;i++)
		cin>>a[i];
	int g[n+1],s[n+1],b[n+1],q[n+1],c[n+1];
	for(int i=1;i<=n;i++)
	{
		g[i]=a[i]%10;
		a[i]/=10;
		s[i]=a[i]%10;
		a[i]/=10;
		b[i]=a[i]%10;
		a[i]/=10;
		q[i]=a[i]%10;
	}
	for(int i=1;i<=n;i++)
	{
		c[i]=0;
	}
	for(int i=1;i<=n;i++)
	{
		if(g[i]==s[i] && s[i]==b[i])
		{
			c[i]+=3;
		}
		if(q[i]==s[i] && s[i]==b[i])
		{
			c[i]+=3;
		}
		if(g[i]==s[i] && b[i]==q[i])
		{
			c[i]+=1;
		}
		if(g[i]==b[i] && s[i]==q[i])
		{
			c[i]+=1;
		}
		if(g[i]==6)
		{
			c[i]+=1;
		}
		if(s[i]==6)
		{
			c[i]+=1;
		}
		if(b[i]==6)
		{
			c[i]+=1;
		}
		if(q[i]==6)
		{
			c[i]+=1;
		}
		if(g[i]==8)
		{
			c[i]+=1;
		}
		if(s[i]==8)
		{
			c[i]+=1;
		}
		if(b[i]==8)
		{
			c[i]+=1;
		}
		if(q[i]==8)
		{
			c[i]+=1;
		}
		if(g[i]==9)
		{
			c[i]+=1;
		}
		if(s[i]==9)
		{
			c[i]+=1;
		}
		if(b[i]==9)
		{
			c[i]+=1;
		}
		if(q[i]==9)
		{
			c[i]+=1;
		}
		if(g[i]==s[i]-1 && s[i]==b[i]-1 && b[i]==q[i]-1)
		{
			c[i]+=5;
		}
		if(g[i]==s[i]+1 && s[i]==b[i]+1 && b[i]==q[i]+1)
		{
			c[i]+=5;
		}
	}
	for(int i=1;i<=n;i++)
	{
		cout<<c[i]<<endl;
	}
	return 0;
}
